XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
/* 0x68 : sf3_if_io_dly_3 */
#define SF_CTRL_SF3_IF_IO_DLY_3_OFFSET   (0x68)
#define SF_CTRL_SF3_IO_2_OE_DLY_SEL      SF_CTRL_SF3_IO_2_OE_DLY_SEL
#define SF_CTRL_SF3_IO_2_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_SF3_IO_2_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_2_OE_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_2_OE_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_OE_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_2_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_2_OE_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_OE_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_2_DI_DLY_SEL      SF_CTRL_SF3_IO_2_DI_DLY_SEL
#define SF_CTRL_SF3_IO_2_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_SF3_IO_2_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_2_DI_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_2_DI_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_DI_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_2_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_2_DI_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_DI_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_2_DO_DLY_SEL      SF_CTRL_SF3_IO_2_DO_DLY_SEL
#define SF_CTRL_SF3_IO_2_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_SF3_IO_2_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_2_DO_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_2_DO_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_DO_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_2_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_2_DO_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_2_DO_DLY_SEL_POS))

/* 0x6C : sf3_if_io_dly_4 */
#define SF_CTRL_SF3_IF_IO_DLY_4_OFFSET   (0x6C)
#define SF_CTRL_SF3_IO_3_OE_DLY_SEL      SF_CTRL_SF3_IO_3_OE_DLY_SEL
#define SF_CTRL_SF3_IO_3_OE_DLY_SEL_POS  (0U)
#define SF_CTRL_SF3_IO_3_OE_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_3_OE_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_3_OE_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_OE_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_3_OE_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_3_OE_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_OE_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_3_DI_DLY_SEL      SF_CTRL_SF3_IO_3_DI_DLY_SEL
#define SF_CTRL_SF3_IO_3_DI_DLY_SEL_POS  (8U)
#define SF_CTRL_SF3_IO_3_DI_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_3_DI_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_3_DI_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_DI_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_3_DI_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_3_DI_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_DI_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_3_DO_DLY_SEL      SF_CTRL_SF3_IO_3_DO_DLY_SEL
#define SF_CTRL_SF3_IO_3_DO_DLY_SEL_POS  (16U)
#define SF_CTRL_SF3_IO_3_DO_DLY_SEL_LEN  (2U)
#define SF_CTRL_SF3_IO_3_DO_DLY_SEL_MSK  (((1U << SF_CTRL_SF3_IO_3_DO_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_DO_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_3_DO_DLY_SEL_UMSK (~(((1U << SF_CTRL_SF3_IO_3_DO_DLY_SEL_LEN) - 1) << SF_CTRL_SF3_IO_3_DO_DLY_SEL_POS))

/* 0x70 : sf_ctrl_2 */
#define SF_CTRL_2_OFFSET                   (0x70)
#define SF_CTRL_SF_IF_PAD_SEL              SF_CTRL_SF_IF_PAD_SEL
#define SF_CTRL_SF_IF_PAD_SEL_POS          (0U)
#define SF_CTRL_SF_IF_PAD_SEL_LEN          (2U)
#define SF_CTRL_SF_IF_PAD_SEL_MSK          (((1U << SF_CTRL_SF_IF_PAD_SEL_LEN) - 1) << SF_CTRL_SF_IF_PAD_SEL_POS)
#define SF_CTRL_SF_IF_PAD_SEL_UMSK         (~(((1U << SF_CTRL_SF_IF_PAD_SEL_LEN) - 1) << SF_CTRL_SF_IF_PAD_SEL_POS))
#define SF_CTRL_SF_IF_PAD_SEL_LOCK         SF_CTRL_SF_IF_PAD_SEL_LOCK
#define SF_CTRL_SF_IF_PAD_SEL_LOCK_POS     (3U)
#define SF_CTRL_SF_IF_PAD_SEL_LOCK_LEN     (1U)
#define SF_CTRL_SF_IF_PAD_SEL_LOCK_MSK     (((1U << SF_CTRL_SF_IF_PAD_SEL_LOCK_LEN) - 1) << SF_CTRL_SF_IF_PAD_SEL_LOCK_POS)
#define SF_CTRL_SF_IF_PAD_SEL_LOCK_UMSK    (~(((1U << SF_CTRL_SF_IF_PAD_SEL_LOCK_LEN) - 1) << SF_CTRL_SF_IF_PAD_SEL_LOCK_POS))
#define SF_CTRL_SF_IF_DTR_EN               SF_CTRL_SF_IF_DTR_EN
#define SF_CTRL_SF_IF_DTR_EN_POS           (4U)
#define SF_CTRL_SF_IF_DTR_EN_LEN           (1U)
#define SF_CTRL_SF_IF_DTR_EN_MSK           (((1U << SF_CTRL_SF_IF_DTR_EN_LEN) - 1) << SF_CTRL_SF_IF_DTR_EN_POS)
#define SF_CTRL_SF_IF_DTR_EN_UMSK          (~(((1U << SF_CTRL_SF_IF_DTR_EN_LEN) - 1) << SF_CTRL_SF_IF_DTR_EN_POS))
#define SF_CTRL_SF_IF_DQS_EN               SF_CTRL_SF_IF_DQS_EN
#define SF_CTRL_SF_IF_DQS_EN_POS           (5U)
#define SF_CTRL_SF_IF_DQS_EN_LEN           (1U)
#define SF_CTRL_SF_IF_DQS_EN_MSK           (((1U << SF_CTRL_SF_IF_DQS_EN_LEN) - 1) << SF_CTRL_SF_IF_DQS_EN_POS)
#define SF_CTRL_SF_IF_DQS_EN_UMSK          (~(((1U << SF_CTRL_SF_IF_DQS_EN_LEN) - 1) << SF_CTRL_SF_IF_DQS_EN_POS))
#define SF_CTRL_SF_IF_TRIG_WR_PROT         SF_CTRL_SF_IF_TRIG_WR_PROT
#define SF_CTRL_SF_IF_TRIG_WR_PROT_POS     (6U)
#define SF_CTRL_SF_IF_TRIG_WR_PROT_LEN     (1U)
#define SF_CTRL_SF_IF_TRIG_WR_PROT_MSK     (((1U << SF_CTRL_SF_IF_TRIG_WR_PROT_LEN) - 1) << SF_CTRL_SF_IF_TRIG_WR_PROT_POS)
#define SF_CTRL_SF_IF_TRIG_WR_PROT_UMSK    (~(((1U << SF_CTRL_SF_IF_TRIG_WR_PROT_LEN) - 1) << SF_CTRL_SF_IF_TRIG_WR_PROT_POS))
#define SF_CTRL_SF_ID_OFFSET_LOCK          SF_CTRL_SF_ID_OFFSET_LOCK
#define SF_CTRL_SF_ID_OFFSET_LOCK_POS      (7U)
#define SF_CTRL_SF_ID_OFFSET_LOCK_LEN      (1U)
#define SF_CTRL_SF_ID_OFFSET_LOCK_MSK      (((1U << SF_CTRL_SF_ID_OFFSET_LOCK_LEN) - 1) << SF_CTRL_SF_ID_OFFSET_LOCK_POS)
#define SF_CTRL_SF_ID_OFFSET_LOCK_UMSK     (~(((1U << SF_CTRL_SF_ID_OFFSET_LOCK_LEN) - 1) << SF_CTRL_SF_ID_OFFSET_LOCK_POS))
#define SF_CTRL_SF_AHB2SIF_REMAP_LOCK      SF_CTRL_SF_AHB2SIF_REMAP_LOCK
#define SF_CTRL_SF_AHB2SIF_REMAP_LOCK_POS  (25U)
#define SF_CTRL_SF_AHB2SIF_REMAP_LOCK_LEN  (1U)
#define SF_CTRL_SF_AHB2SIF_REMAP_LOCK_MSK  (((1U << SF_CTRL_SF_AHB2SIF_REMAP_LOCK_LEN) - 1) << SF_CTRL_SF_AHB2SIF_REMAP_LOCK_POS)
#define SF_CTRL_SF_AHB2SIF_REMAP_LOCK_UMSK (~(((1U << SF_CTRL_SF_AHB2SIF_REMAP_LOCK_LEN) - 1) << SF_CTRL_SF_AHB2SIF_REMAP_LOCK_POS))
#define SF_CTRL_SF_AHB2SIF_REMAP           SF_CTRL_SF_AHB2SIF_REMAP
#define SF_CTRL_SF_AHB2SIF_REMAP_POS       (26U)
#define SF_CTRL_SF_AHB2SIF_REMAP_LEN       (2U)
#define SF_CTRL_SF_AHB2SIF_REMAP_MSK       (((1U << SF_CTRL_SF_AHB2SIF_REMAP_LEN) - 1) << SF_CTRL_SF_AHB2SIF_REMAP_POS)
#define SF_CTRL_SF_AHB2SIF_REMAP_UMSK      (~(((1U << SF_CTRL_SF_AHB2SIF_REMAP_LEN) - 1) << SF_CTRL_SF_AHB2SIF_REMAP_POS))
#define SF_CTRL_SF_IF_BK_SWAP              SF_CTRL_SF_IF_BK_SWAP
#define SF_CTRL_SF_IF_BK_SWAP_POS          (28U)
#define SF_CTRL_SF_IF_BK_SWAP_LEN          (1U)
#define SF_CTRL_SF_IF_BK_SWAP_MSK          (((1U << SF_CTRL_SF_IF_BK_SWAP_LEN) - 1) << SF_CTRL_SF_IF_BK_SWAP_POS)
#define SF_CTRL_SF_IF_BK_SWAP_UMSK         (~(((1U << SF_CTRL_SF_IF_BK_SWAP_LEN) - 1) << SF_CTRL_SF_IF_BK_SWAP_POS))
#define SF_CTRL_SF_IF_BK2_MODE             SF_CTRL_SF_IF_BK2_MODE
#define SF_CTRL_SF_IF_BK2_MODE_POS         (29U)
#define SF_CTRL_SF_IF_BK2_MODE_LEN         (1U)
#define SF_CTRL_SF_IF_BK2_MODE_MSK         (((1U << SF_CTRL_SF_IF_BK2_MODE_LEN) - 1) << SF_CTRL_SF_IF_BK2_MODE_POS)
#define SF_CTRL_SF_IF_BK2_MODE_UMSK        (~(((1U << SF_CTRL_SF_IF_BK2_MODE_LEN) - 1) << SF_CTRL_SF_IF_BK2_MODE_POS))
#define SF_CTRL_SF_IF_BK2_EN               SF_CTRL_SF_IF_BK2_EN
#define SF_CTRL_SF_IF_BK2_EN_POS           (30U)
#define SF_CTRL_SF_IF_BK2_EN_LEN           (1U)
#define SF_CTRL_SF_IF_BK2_EN_MSK           (((1U << SF_CTRL_SF_IF_BK2_EN_LEN) - 1) << SF_CTRL_SF_IF_BK2_EN_POS)
#define SF_CTRL_SF_IF_BK2_EN_UMSK          (~(((1U << SF_CTRL_SF_IF_BK2_EN_LEN) - 1) << SF_CTRL_SF_IF_BK2_EN_POS))
#define SF_CTRL_SF_IF_0_BK_SEL             SF_CTRL_SF_IF_0_BK_SEL
#define SF_CTRL_SF_IF_0_BK_SEL_POS         (31U)
#define SF_CTRL_SF_IF_0_BK_SEL_LEN         (1U)
#define SF_CTRL_SF_IF_0_BK_SEL_MSK         (((1U << SF_CTRL_SF_IF_0_BK_SEL_LEN) - 1) << SF_CTRL_SF_IF_0_BK_SEL_POS)
#define SF_CTRL_SF_IF_0_BK_SEL_UMSK        (~(((1U << SF_CTRL_SF_IF_0_BK_SEL_LEN) - 1) << SF_CTRL_SF_IF_0_BK_SEL_POS))

/* 0x74 : sf_ctrl_3 */
#define SF_CTRL_3_OFFSET                  (0x74)
#define SF_CTRL_SF_CMDS_2_WRAP_LEN        SF_CTRL_SF_CMDS_2_WRAP_LEN
#define SF_CTRL_SF_CMDS_2_WRAP_LEN_POS    (0U)
#define SF_CTRL_SF_CMDS_2_WRAP_LEN_LEN    (4U)
#define SF_CTRL_SF_CMDS_2_WRAP_LEN_MSK    (((1U << SF_CTRL_SF_CMDS_2_WRAP_LEN_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_LEN_POS)
#define SF_CTRL_SF_CMDS_2_WRAP_LEN_UMSK   (~(((1U << SF_CTRL_SF_CMDS_2_WRAP_LEN_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_LEN_POS))
#define SF_CTRL_SF_CMDS_2_EN              SF_CTRL_SF_CMDS_2_EN
#define SF_CTRL_SF_CMDS_2_EN_POS          (4U)
#define SF_CTRL_SF_CMDS_2_EN_LEN          (1U)
#define SF_CTRL_SF_CMDS_2_EN_MSK          (((1U << SF_CTRL_SF_CMDS_2_EN_LEN) - 1) << SF_CTRL_SF_CMDS_2_EN_POS)
#define SF_CTRL_SF_CMDS_2_EN_UMSK         (~(((1U << SF_CTRL_SF_CMDS_2_EN_LEN) - 1) << SF_CTRL_SF_CMDS_2_EN_POS))
#define SF_CTRL_SF_CMDS_2_BT_DLY          SF_CTRL_SF_CMDS_2_BT_DLY
#define SF_CTRL_SF_CMDS_2_BT_DLY_POS      (5U)
#define SF_CTRL_SF_CMDS_2_BT_DLY_LEN      (3U)
#define SF_CTRL_SF_CMDS_2_BT_DLY_MSK      (((1U << SF_CTRL_SF_CMDS_2_BT_DLY_LEN) - 1) << SF_CTRL_SF_CMDS_2_BT_DLY_POS)
#define SF_CTRL_SF_CMDS_2_BT_DLY_UMSK     (~(((1U << SF_CTRL_SF_CMDS_2_BT_DLY_LEN) - 1) << SF_CTRL_SF_CMDS_2_BT_DLY_POS))
#define SF_CTRL_SF_CMDS_2_BT_EN           SF_CTRL_SF_CMDS_2_BT_EN
#define SF_CTRL_SF_CMDS_2_BT_EN_POS       (8U)
#define SF_CTRL_SF_CMDS_2_BT_EN_LEN       (1U)
#define SF_CTRL_SF_CMDS_2_BT_EN_MSK       (((1U << SF_CTRL_SF_CMDS_2_BT_EN_LEN) - 1) << SF_CTRL_SF_CMDS_2_BT_EN_POS)
#define SF_CTRL_SF_CMDS_2_BT_EN_UMSK      (~(((1U << SF_CTRL_SF_CMDS_2_BT_EN_LEN) - 1) << SF_CTRL_SF_CMDS_2_BT_EN_POS))
#define SF_CTRL_SF_CMDS_2_WRAP_Q_INI      SF_CTRL_SF_CMDS_2_WRAP_Q_INI
#define SF_CTRL_SF_CMDS_2_WRAP_Q_INI_POS  (9U)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_INI_LEN  (1U)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_INI_MSK  (((1U << SF_CTRL_SF_CMDS_2_WRAP_Q_INI_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_Q_INI_POS)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_INI_UMSK (~(((1U << SF_CTRL_SF_CMDS_2_WRAP_Q_INI_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_Q_INI_POS))
#define SF_CTRL_SF_CMDS_2_WRAP_MODE       SF_CTRL_SF_CMDS_2_WRAP_MODE
#define SF_CTRL_SF_CMDS_2_WRAP_MODE_POS   (10U)
#define SF_CTRL_SF_CMDS_2_WRAP_MODE_LEN   (2U)
#define SF_CTRL_SF_CMDS_2_WRAP_MODE_MSK   (((1U << SF_CTRL_SF_CMDS_2_WRAP_MODE_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_MODE_POS)
#define SF_CTRL_SF_CMDS_2_WRAP_MODE_UMSK  (~(((1U << SF_CTRL_SF_CMDS_2_WRAP_MODE_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_MODE_POS))
#define SF_CTRL_SF_CMDS_2_WRAP_Q          SF_CTRL_SF_CMDS_2_WRAP_Q
#define SF_CTRL_SF_CMDS_2_WRAP_Q_POS      (12U)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_LEN      (1U)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_MSK      (((1U << SF_CTRL_SF_CMDS_2_WRAP_Q_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_Q_POS)
#define SF_CTRL_SF_CMDS_2_WRAP_Q_UMSK     (~(((1U << SF_CTRL_SF_CMDS_2_WRAP_Q_LEN) - 1) << SF_CTRL_SF_CMDS_2_WRAP_Q_POS))
#define SF_CTRL_SF_CMDS_1_WRAP_LEN        SF_CTRL_SF_CMDS_1_WRAP_LEN
#define SF_CTRL_SF_CMDS_1_WRAP_LEN_POS    (13U)
#define SF_CTRL_SF_CMDS_1_WRAP_LEN_LEN    (4U)
#define SF_CTRL_SF_CMDS_1_WRAP_LEN_MSK    (((1U << SF_CTRL_SF_CMDS_1_WRAP_LEN_LEN) - 1) << SF_CTRL_SF_CMDS_1_WRAP_LEN_POS)
#define SF_CTRL_SF_CMDS_1_WRAP_LEN_UMSK   (~(((1U << SF_CTRL_SF_CMDS_1_WRAP_LEN_LEN) - 1) << SF_CTRL_SF_CMDS_1_WRAP_LEN_POS))
#define SF_CTRL_SF_CMDS_1_EN              SF_CTRL_SF_CMDS_1_EN
#define SF_CTRL_SF_CMDS_1_EN_POS          (17U)
#define SF_CTRL_SF_CMDS_1_EN_LEN          (1U)
#define SF_CTRL_SF_CMDS_1_EN_MSK          (((1U << SF_CTRL_SF_CMDS_1_EN_LEN) - 1) << SF_CTRL_SF_CMDS_1_EN_POS)
#define SF_CTRL_SF_CMDS_1_EN_UMSK         (~(((1U << SF_CTRL_SF_CMDS_1_EN_LEN) - 1) << SF_CTRL_SF_CMDS_1_EN_POS))
#define SF_CTRL_SF_CMDS_1_WRAP_MODE       SF_CTRL_SF_CMDS_1_WRAP_MODE
#define SF_CTRL_SF_CMDS_1_WRAP_MODE_POS   (18U)
#define SF_CTRL_SF_CMDS_1_WRAP_MODE_LEN   (2U)
#define SF_CTRL_SF_CMDS_1_WRAP_MODE_MSK   (((1U << SF_CTRL_SF_CMDS_1_WRAP_MODE_LEN) - 1) << SF_CTRL_SF_CMDS_1_WRAP_MODE_POS)
#define SF_CTRL_SF_CMDS_1_WRAP_MODE_UMSK  (~(((1U << SF_CTRL_SF_CMDS_1_WRAP_MODE_LEN) - 1) << SF_CTRL_SF_CMDS_1_WRAP_MODE_POS))
#define SF_CTRL_SF_CMDS_CORE_EN           SF_CTRL_SF_CMDS_CORE_EN
#define SF_CTRL_SF_CMDS_CORE_EN_POS       (20U)
#define SF_CTRL_SF_CMDS_CORE_EN_LEN       (1U)
#define SF_CTRL_SF_CMDS_CORE_EN_MSK       (((1U << SF_CTRL_SF_CMDS_CORE_EN_LEN) - 1) << SF_CTRL_SF_CMDS_CORE_EN_POS)
#define SF_CTRL_SF_CMDS_CORE_EN_UMSK      (~(((1U << SF_CTRL_SF_CMDS_CORE_EN_LEN) - 1) << SF_CTRL_SF_CMDS_CORE_EN_POS))
#define SF_CTRL_SF_IF_1_ACK_LAT           SF_CTRL_SF_IF_1_ACK_LAT
#define SF_CTRL_SF_IF_1_ACK_LAT_POS       (29U)
#define SF_CTRL_SF_IF_1_ACK_LAT_LEN       (3U)
#define SF_CTRL_SF_IF_1_ACK_LAT_MSK       (((1U << SF_CTRL_SF_IF_1_ACK_LAT_LEN) - 1) << SF_CTRL_SF_IF_1_ACK_LAT_POS)
#define SF_CTRL_SF_IF_1_ACK_LAT_UMSK      (~(((1U << SF_CTRL_SF_IF_1_ACK_LAT_LEN) - 1) << SF_CTRL_SF_IF_1_ACK_LAT_POS))

/* 0x78 : sf_if_iahb_3 */
#define SF_CTRL_SF_IF_IAHB_3_OFFSET      (0x78)
#define SF_CTRL_SF_IF_2_DMY_BYTE         SF_CTRL_SF_IF_2_DMY_BYTE
#define SF_CTRL_SF_IF_2_DMY_BYTE_POS     (12U)
#define SF_CTRL_SF_IF_2_DMY_BYTE_LEN     (5U)
#define SF_CTRL_SF_IF_2_DMY_BYTE_MSK     (((1U << SF_CTRL_SF_IF_2_DMY_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_DMY_BYTE_POS)
#define SF_CTRL_SF_IF_2_DMY_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF_2_DMY_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_DMY_BYTE_POS))
#define SF_CTRL_SF_IF_2_ADR_BYTE         SF_CTRL_SF_IF_2_ADR_BYTE
#define SF_CTRL_SF_IF_2_ADR_BYTE_POS     (17U)
#define SF_CTRL_SF_IF_2_ADR_BYTE_LEN     (3U)
#define SF_CTRL_SF_IF_2_ADR_BYTE_MSK     (((1U << SF_CTRL_SF_IF_2_ADR_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_ADR_BYTE_POS)
#define SF_CTRL_SF_IF_2_ADR_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF_2_ADR_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_ADR_BYTE_POS))
#define SF_CTRL_SF_IF_2_CMD_BYTE         SF_CTRL_SF_IF_2_CMD_BYTE
#define SF_CTRL_SF_IF_2_CMD_BYTE_POS     (20U)
#define SF_CTRL_SF_IF_2_CMD_BYTE_LEN     (3U)
#define SF_CTRL_SF_IF_2_CMD_BYTE_MSK     (((1U << SF_CTRL_SF_IF_2_CMD_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_CMD_BYTE_POS)
#define SF_CTRL_SF_IF_2_CMD_BYTE_UMSK    (~(((1U << SF_CTRL_SF_IF_2_CMD_BYTE_LEN) - 1) << SF_CTRL_SF_IF_2_CMD_BYTE_POS))
#define SF_CTRL_SF_IF_2_DAT_RW           SF_CTRL_SF_IF_2_DAT_RW
#define SF_CTRL_SF_IF_2_DAT_RW_POS       (23U)
#define SF_CTRL_SF_IF_2_DAT_RW_LEN       (1U)
#define SF_CTRL_SF_IF_2_DAT_RW_MSK       (((1U << SF_CTRL_SF_IF_2_DAT_RW_LEN) - 1) << SF_CTRL_SF_IF_2_DAT_RW_POS)
#define SF_CTRL_SF_IF_2_DAT_RW_UMSK      (~(((1U << SF_CTRL_SF_IF_2_DAT_RW_LEN) - 1) << SF_CTRL_SF_IF_2_DAT_RW_POS))
#define SF_CTRL_SF_IF_2_DAT_EN           SF_CTRL_SF_IF_2_DAT_EN
#define SF_CTRL_SF_IF_2_DAT_EN_POS       (24U)
#define SF_CTRL_SF_IF_2_DAT_EN_LEN       (1U)
#define SF_CTRL_SF_IF_2_DAT_EN_MSK       (((1U << SF_CTRL_SF_IF_2_DAT_EN_LEN) - 1) << SF_CTRL_SF_IF_2_DAT_EN_POS)
#define SF_CTRL_SF_IF_2_DAT_EN_UMSK      (~(((1U << SF_CTRL_SF_IF_2_DAT_EN_LEN) - 1) << SF_CTRL_SF_IF_2_DAT_EN_POS))
#define SF_CTRL_SF_IF_2_DMY_EN           SF_CTRL_SF_IF_2_DMY_EN
#define SF_CTRL_SF_IF_2_DMY_EN_POS       (25U)
#define SF_CTRL_SF_IF_2_DMY_EN_LEN       (1U)
#define SF_CTRL_SF_IF_2_DMY_EN_MSK       (((1U << SF_CTRL_SF_IF_2_DMY_EN_LEN) - 1) << SF_CTRL_SF_IF_2_DMY_EN_POS)
#define SF_CTRL_SF_IF_2_DMY_EN_UMSK      (~(((1U << SF_CTRL_SF_IF_2_DMY_EN_LEN) - 1) << SF_CTRL_SF_IF_2_DMY_EN_POS))
#define SF_CTRL_SF_IF_2_ADR_EN           SF_CTRL_SF_IF_2_ADR_EN
#define SF_CTRL_SF_IF_2_ADR_EN_POS       (26U)
#define SF_CTRL_SF_IF_2_ADR_EN_LEN       (1U)
#define SF_CTRL_SF_IF_2_ADR_EN_MSK       (((1U << SF_CTRL_SF_IF_2_ADR_EN_LEN) - 1) << SF_CTRL_SF_IF_2_ADR_EN_POS)
#define SF_CTRL_SF_IF_2_ADR_EN_UMSK      (~(((1U << SF_CTRL_SF_IF_2_ADR_EN_LEN) - 1) << SF_CTRL_SF_IF_2_ADR_EN_POS))
#define SF_CTRL_SF_IF_2_CMD_EN           SF_CTRL_SF_IF_2_CMD_EN
#define SF_CTRL_SF_IF_2_CMD_EN_POS       (27U)
#define SF_CTRL_SF_IF_2_CMD_EN_LEN       (1U)
#define SF_CTRL_SF_IF_2_CMD_EN_MSK       (((1U << SF_CTRL_SF_IF_2_CMD_EN_LEN) - 1) << SF_CTRL_SF_IF_2_CMD_EN_POS)
#define SF_CTRL_SF_IF_2_CMD_EN_UMSK      (~(((1U << SF_CTRL_SF_IF_2_CMD_EN_LEN) - 1) << SF_CTRL_SF_IF_2_CMD_EN_POS))
#define SF_CTRL_SF_IF_2_SPI_MODE         SF_CTRL_SF_IF_2_SPI_MODE
#define SF_CTRL_SF_IF_2_SPI_MODE_POS     (28U)
#define SF_CTRL_SF_IF_2_SPI_MODE_LEN     (3U)
#define SF_CTRL_SF_IF_2_SPI_MODE_MSK     (((1U << SF_CTRL_SF_IF_2_SPI_MODE_LEN) - 1) << SF_CTRL_SF_IF_2_SPI_MODE_POS)
#define SF_CTRL_SF_IF_2_SPI_MODE_UMSK    (~(((1U << SF_CTRL_SF_IF_2_SPI_MODE_LEN) - 1) << SF_CTRL_SF_IF_2_SPI_MODE_POS))
#define SF_CTRL_SF_IF_2_QPI_MODE_EN      SF_CTRL_SF_IF_2_QPI_MODE_EN
#define SF_CTRL_SF_IF_2_QPI_MODE_EN_POS  (31U)
#define SF_CTRL_SF_IF_2_QPI_MODE_EN_LEN  (1U)
#define SF_CTRL_SF_IF_2_QPI_MODE_EN_MSK  (((1U << SF_CTRL_SF_IF_2_QPI_MODE_EN_LEN) - 1) << SF_CTRL_SF_IF_2_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF_2_QPI_MODE_EN_UMSK (~(((1U << SF_CTRL_SF_IF_2_QPI_MODE_EN_LEN) - 1) << SF_CTRL_SF_IF_2_QPI_MODE_EN_POS))

