XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
/* 0xC0 : sf_if2_ctrl_0 */
#define SF_CTRL_SF_IF2_CTRL_0_OFFSET          (0xC0)
#define SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL      SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL
#define SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_POS  (2U)
#define SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_LEN  (1U)
#define SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_MSK  (((1U << SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_LEN) - 1) << SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_POS)
#define SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_UMSK (~(((1U << SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_LEN) - 1) << SF_CTRL_SF_CLK_SF_IF2_RX_INV_SEL_POS))
#define SF_CTRL_SF_IF2_READ_DLY_N             SF_CTRL_SF_IF2_READ_DLY_N
#define SF_CTRL_SF_IF2_READ_DLY_N_POS         (8U)
#define SF_CTRL_SF_IF2_READ_DLY_N_LEN         (3U)
#define SF_CTRL_SF_IF2_READ_DLY_N_MSK         (((1U << SF_CTRL_SF_IF2_READ_DLY_N_LEN) - 1) << SF_CTRL_SF_IF2_READ_DLY_N_POS)
#define SF_CTRL_SF_IF2_READ_DLY_N_UMSK        (~(((1U << SF_CTRL_SF_IF2_READ_DLY_N_LEN) - 1) << SF_CTRL_SF_IF2_READ_DLY_N_POS))
#define SF_CTRL_SF_IF2_READ_DLY_EN            SF_CTRL_SF_IF2_READ_DLY_EN
#define SF_CTRL_SF_IF2_READ_DLY_EN_POS        (11U)
#define SF_CTRL_SF_IF2_READ_DLY_EN_LEN        (1U)
#define SF_CTRL_SF_IF2_READ_DLY_EN_MSK        (((1U << SF_CTRL_SF_IF2_READ_DLY_EN_LEN) - 1) << SF_CTRL_SF_IF2_READ_DLY_EN_POS)
#define SF_CTRL_SF_IF2_READ_DLY_EN_UMSK       (~(((1U << SF_CTRL_SF_IF2_READ_DLY_EN_LEN) - 1) << SF_CTRL_SF_IF2_READ_DLY_EN_POS))
#define SF_CTRL_SF_IF2_INT                    SF_CTRL_SF_IF2_INT
#define SF_CTRL_SF_IF2_INT_POS                (16U)
#define SF_CTRL_SF_IF2_INT_LEN                (1U)
#define SF_CTRL_SF_IF2_INT_MSK                (((1U << SF_CTRL_SF_IF2_INT_LEN) - 1) << SF_CTRL_SF_IF2_INT_POS)
#define SF_CTRL_SF_IF2_INT_UMSK               (~(((1U << SF_CTRL_SF_IF2_INT_LEN) - 1) << SF_CTRL_SF_IF2_INT_POS))
#define SF_CTRL_SF_IF2_INT_CLR                SF_CTRL_SF_IF2_INT_CLR
#define SF_CTRL_SF_IF2_INT_CLR_POS            (17U)
#define SF_CTRL_SF_IF2_INT_CLR_LEN            (1U)
#define SF_CTRL_SF_IF2_INT_CLR_MSK            (((1U << SF_CTRL_SF_IF2_INT_CLR_LEN) - 1) << SF_CTRL_SF_IF2_INT_CLR_POS)
#define SF_CTRL_SF_IF2_INT_CLR_UMSK           (~(((1U << SF_CTRL_SF_IF2_INT_CLR_LEN) - 1) << SF_CTRL_SF_IF2_INT_CLR_POS))
#define SF_CTRL_SF_IF2_INT_SET                SF_CTRL_SF_IF2_INT_SET
#define SF_CTRL_SF_IF2_INT_SET_POS            (18U)
#define SF_CTRL_SF_IF2_INT_SET_LEN            (1U)
#define SF_CTRL_SF_IF2_INT_SET_MSK            (((1U << SF_CTRL_SF_IF2_INT_SET_LEN) - 1) << SF_CTRL_SF_IF2_INT_SET_POS)
#define SF_CTRL_SF_IF2_INT_SET_UMSK           (~(((1U << SF_CTRL_SF_IF2_INT_SET_LEN) - 1) << SF_CTRL_SF_IF2_INT_SET_POS))
#define SF_CTRL_SF_IF2_REPLACE_SF1            SF_CTRL_SF_IF2_REPLACE_SF1
#define SF_CTRL_SF_IF2_REPLACE_SF1_POS        (23U)
#define SF_CTRL_SF_IF2_REPLACE_SF1_LEN        (1U)
#define SF_CTRL_SF_IF2_REPLACE_SF1_MSK        (((1U << SF_CTRL_SF_IF2_REPLACE_SF1_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF1_POS)
#define SF_CTRL_SF_IF2_REPLACE_SF1_UMSK       (~(((1U << SF_CTRL_SF_IF2_REPLACE_SF1_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF1_POS))
#define SF_CTRL_SF_IF2_REPLACE_SF2            SF_CTRL_SF_IF2_REPLACE_SF2
#define SF_CTRL_SF_IF2_REPLACE_SF2_POS        (24U)
#define SF_CTRL_SF_IF2_REPLACE_SF2_LEN        (1U)
#define SF_CTRL_SF_IF2_REPLACE_SF2_MSK        (((1U << SF_CTRL_SF_IF2_REPLACE_SF2_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF2_POS)
#define SF_CTRL_SF_IF2_REPLACE_SF2_UMSK       (~(((1U << SF_CTRL_SF_IF2_REPLACE_SF2_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF2_POS))
#define SF_CTRL_SF_IF2_REPLACE_SF3            SF_CTRL_SF_IF2_REPLACE_SF3
#define SF_CTRL_SF_IF2_REPLACE_SF3_POS        (25U)
#define SF_CTRL_SF_IF2_REPLACE_SF3_LEN        (1U)
#define SF_CTRL_SF_IF2_REPLACE_SF3_MSK        (((1U << SF_CTRL_SF_IF2_REPLACE_SF3_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF3_POS)
#define SF_CTRL_SF_IF2_REPLACE_SF3_UMSK       (~(((1U << SF_CTRL_SF_IF2_REPLACE_SF3_LEN) - 1) << SF_CTRL_SF_IF2_REPLACE_SF3_POS))
#define SF_CTRL_SF_IF2_PAD_SEL                SF_CTRL_SF_IF2_PAD_SEL
#define SF_CTRL_SF_IF2_PAD_SEL_POS            (26U)
#define SF_CTRL_SF_IF2_PAD_SEL_LEN            (2U)
#define SF_CTRL_SF_IF2_PAD_SEL_MSK            (((1U << SF_CTRL_SF_IF2_PAD_SEL_LEN) - 1) << SF_CTRL_SF_IF2_PAD_SEL_POS)
#define SF_CTRL_SF_IF2_PAD_SEL_UMSK           (~(((1U << SF_CTRL_SF_IF2_PAD_SEL_LEN) - 1) << SF_CTRL_SF_IF2_PAD_SEL_POS))
#define SF_CTRL_SF_IF2_BK_SWAP                SF_CTRL_SF_IF2_BK_SWAP
#define SF_CTRL_SF_IF2_BK_SWAP_POS            (28U)
#define SF_CTRL_SF_IF2_BK_SWAP_LEN            (1U)
#define SF_CTRL_SF_IF2_BK_SWAP_MSK            (((1U << SF_CTRL_SF_IF2_BK_SWAP_LEN) - 1) << SF_CTRL_SF_IF2_BK_SWAP_POS)
#define SF_CTRL_SF_IF2_BK_SWAP_UMSK           (~(((1U << SF_CTRL_SF_IF2_BK_SWAP_LEN) - 1) << SF_CTRL_SF_IF2_BK_SWAP_POS))
#define SF_CTRL_SF_IF2_BK2_MODE               SF_CTRL_SF_IF2_BK2_MODE
#define SF_CTRL_SF_IF2_BK2_MODE_POS           (29U)
#define SF_CTRL_SF_IF2_BK2_MODE_LEN           (1U)
#define SF_CTRL_SF_IF2_BK2_MODE_MSK           (((1U << SF_CTRL_SF_IF2_BK2_MODE_LEN) - 1) << SF_CTRL_SF_IF2_BK2_MODE_POS)
#define SF_CTRL_SF_IF2_BK2_MODE_UMSK          (~(((1U << SF_CTRL_SF_IF2_BK2_MODE_LEN) - 1) << SF_CTRL_SF_IF2_BK2_MODE_POS))
#define SF_CTRL_SF_IF2_BK2_EN                 SF_CTRL_SF_IF2_BK2_EN
#define SF_CTRL_SF_IF2_BK2_EN_POS             (30U)
#define SF_CTRL_SF_IF2_BK2_EN_LEN             (1U)
#define SF_CTRL_SF_IF2_BK2_EN_MSK             (((1U << SF_CTRL_SF_IF2_BK2_EN_LEN) - 1) << SF_CTRL_SF_IF2_BK2_EN_POS)
#define SF_CTRL_SF_IF2_BK2_EN_UMSK            (~(((1U << SF_CTRL_SF_IF2_BK2_EN_LEN) - 1) << SF_CTRL_SF_IF2_BK2_EN_POS))
#define SF_CTRL_SF_IF2_BK_SEL                 SF_CTRL_SF_IF2_BK_SEL
#define SF_CTRL_SF_IF2_BK_SEL_POS             (31U)
#define SF_CTRL_SF_IF2_BK_SEL_LEN             (1U)
#define SF_CTRL_SF_IF2_BK_SEL_MSK             (((1U << SF_CTRL_SF_IF2_BK_SEL_LEN) - 1) << SF_CTRL_SF_IF2_BK_SEL_POS)
#define SF_CTRL_SF_IF2_BK_SEL_UMSK            (~(((1U << SF_CTRL_SF_IF2_BK_SEL_LEN) - 1) << SF_CTRL_SF_IF2_BK_SEL_POS))

