XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
/* 0x314 : sf_aes_key_r2_5 */
#define SF_CTRL_SF_AES_KEY_R2_5_OFFSET (0x314)
#define SF_CTRL_SF_AES_KEY_R2_5        SF_CTRL_SF_AES_KEY_R2_5
#define SF_CTRL_SF_AES_KEY_R2_5_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R2_5_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R2_5_MSK    (((1U << SF_CTRL_SF_AES_KEY_R2_5_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_5_POS)
#define SF_CTRL_SF_AES_KEY_R2_5_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R2_5_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_5_POS))

/* 0x318 : sf_aes_key_r2_6 */
#define SF_CTRL_SF_AES_KEY_R2_6_OFFSET (0x318)
#define SF_CTRL_SF_AES_KEY_R2_6        SF_CTRL_SF_AES_KEY_R2_6
#define SF_CTRL_SF_AES_KEY_R2_6_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R2_6_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R2_6_MSK    (((1U << SF_CTRL_SF_AES_KEY_R2_6_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_6_POS)
#define SF_CTRL_SF_AES_KEY_R2_6_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R2_6_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_6_POS))

/* 0x31C : sf_aes_key_r2_7 */
#define SF_CTRL_SF_AES_KEY_R2_7_OFFSET (0x31C)
#define SF_CTRL_SF_AES_KEY_R2_7        SF_CTRL_SF_AES_KEY_R2_7
#define SF_CTRL_SF_AES_KEY_R2_7_POS    (0U)
#define SF_CTRL_SF_AES_KEY_R2_7_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_R2_7_MSK    (((1U << SF_CTRL_SF_AES_KEY_R2_7_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_7_POS)
#define SF_CTRL_SF_AES_KEY_R2_7_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_R2_7_LEN) - 1) << SF_CTRL_SF_AES_KEY_R2_7_POS))

/* 0x320 : sf_aes_iv_r2_w0 */
#define SF_CTRL_SF_AES_IV_R2_W0_OFFSET (0x320)
#define SF_CTRL_SF_AES_IV_R2_W0        SF_CTRL_SF_AES_IV_R2_W0
#define SF_CTRL_SF_AES_IV_R2_W0_POS    (0U)
#define SF_CTRL_SF_AES_IV_R2_W0_LEN    (32U)
#define SF_CTRL_SF_AES_IV_R2_W0_MSK    (((1U << SF_CTRL_SF_AES_IV_R2_W0_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W0_POS)
#define SF_CTRL_SF_AES_IV_R2_W0_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_R2_W0_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W0_POS))

/* 0x324 : sf_aes_iv_r2_w1 */
#define SF_CTRL_SF_AES_IV_R2_W1_OFFSET (0x324)
#define SF_CTRL_SF_AES_IV_R2_W1        SF_CTRL_SF_AES_IV_R2_W1
#define SF_CTRL_SF_AES_IV_R2_W1_POS    (0U)
#define SF_CTRL_SF_AES_IV_R2_W1_LEN    (32U)
#define SF_CTRL_SF_AES_IV_R2_W1_MSK    (((1U << SF_CTRL_SF_AES_IV_R2_W1_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W1_POS)
#define SF_CTRL_SF_AES_IV_R2_W1_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_R2_W1_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W1_POS))

/* 0x328 : sf_aes_iv_r2_w2 */
#define SF_CTRL_SF_AES_IV_R2_W2_OFFSET (0x328)
#define SF_CTRL_SF_AES_IV_R2_W2        SF_CTRL_SF_AES_IV_R2_W2
#define SF_CTRL_SF_AES_IV_R2_W2_POS    (0U)
#define SF_CTRL_SF_AES_IV_R2_W2_LEN    (32U)
#define SF_CTRL_SF_AES_IV_R2_W2_MSK    (((1U << SF_CTRL_SF_AES_IV_R2_W2_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W2_POS)
#define SF_CTRL_SF_AES_IV_R2_W2_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_R2_W2_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W2_POS))

/* 0x32C : sf_aes_iv_r2_w3 */
#define SF_CTRL_SF_AES_IV_R2_W3_OFFSET (0x32C)
#define SF_CTRL_SF_AES_IV_R2_W3        SF_CTRL_SF_AES_IV_R2_W3
#define SF_CTRL_SF_AES_IV_R2_W3_POS    (0U)
#define SF_CTRL_SF_AES_IV_R2_W3_LEN    (32U)
#define SF_CTRL_SF_AES_IV_R2_W3_MSK    (((1U << SF_CTRL_SF_AES_IV_R2_W3_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W3_POS)
#define SF_CTRL_SF_AES_IV_R2_W3_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_R2_W3_LEN) - 1) << SF_CTRL_SF_AES_IV_R2_W3_POS))

/* 0x330 : sf_aes_r2_start */
#define SF_CTRL_SF_AES_R2_START_OFFSET   (0x330)
#define SF_CTRL_SF_AES_R2_START          SF_CTRL_SF_AES_R2_START
#define SF_CTRL_SF_AES_R2_START_POS      (0U)
#define SF_CTRL_SF_AES_R2_START_LEN      (19U)
#define SF_CTRL_SF_AES_R2_START_MSK      (((1U << SF_CTRL_SF_AES_R2_START_LEN) - 1) << SF_CTRL_SF_AES_R2_START_POS)
#define SF_CTRL_SF_AES_R2_START_UMSK     (~(((1U << SF_CTRL_SF_AES_R2_START_LEN) - 1) << SF_CTRL_SF_AES_R2_START_POS))
#define SF_CTRL_SF_AES_R2_HW_KEY_EN      SF_CTRL_SF_AES_R2_HW_KEY_EN
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_POS  (29U)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN  (1U)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_MSK  (((1U << SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN) - 1) << SF_CTRL_SF_AES_R2_HW_KEY_EN_POS)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_UMSK (~(((1U << SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN) - 1) << SF_CTRL_SF_AES_R2_HW_KEY_EN_POS))
#define SF_CTRL_SF_AES_R2_EN             SF_CTRL_SF_AES_R2_EN
#define SF_CTRL_SF_AES_R2_EN_POS         (30U)
#define SF_CTRL_SF_AES_R2_EN_LEN         (1U)
#define SF_CTRL_SF_AES_R2_EN_MSK         (((1U << SF_CTRL_SF_AES_R2_EN_LEN) - 1) << SF_CTRL_SF_AES_R2_EN_POS)
#define SF_CTRL_SF_AES_R2_EN_UMSK        (~(((1U << SF_CTRL_SF_AES_R2_EN_LEN) - 1) << SF_CTRL_SF_AES_R2_EN_POS))
#define SF_CTRL_SF_AES_R2_LOCK           SF_CTRL_SF_AES_R2_LOCK
#define SF_CTRL_SF_AES_R2_LOCK_POS       (31U)
#define SF_CTRL_SF_AES_R2_LOCK_LEN       (1U)
#define SF_CTRL_SF_AES_R2_LOCK_MSK       (((1U << SF_CTRL_SF_AES_R2_LOCK_LEN) - 1) << SF_CTRL_SF_AES_R2_LOCK_POS)
#define SF_CTRL_SF_AES_R2_LOCK_UMSK      (~(((1U << SF_CTRL_SF_AES_R2_LOCK_LEN) - 1) << SF_CTRL_SF_AES_R2_LOCK_POS))

/* 0x334 : sf_aes_r2_end */
#define SF_CTRL_SF_AES_R2_END_OFFSET (0x334)
#define SF_CTRL_SF_AES_R2_END        SF_CTRL_SF_AES_R2_END
#define SF_CTRL_SF_AES_R2_END_POS    (0U)
#define SF_CTRL_SF_AES_R2_END_LEN    (19U)
#define SF_CTRL_SF_AES_R2_END_MSK    (((1U << SF_CTRL_SF_AES_R2_END_LEN) - 1) << SF_CTRL_SF_AES_R2_END_POS)
#define SF_CTRL_SF_AES_R2_END_UMSK   (~(((1U << SF_CTRL_SF_AES_R2_END_LEN) - 1) << SF_CTRL_SF_AES_R2_END_POS))

struct sf_ctrl_reg {
    /* 0x0 : sf_ctrl_0 */
    union {
        struct {
            uint32_t reserved_0_1         : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t sf_clk_sf_rx_inv_sel : 1; /* [    2],        r/w,        0x1 */
            uint32_t sf_clk_out_gate_en   : 1; /* [    3],        r/w,        0x1 */
            uint32_t sf_clk_out_inv_sel   : 1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7         : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t sf_if_read_dly_n     : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t sf_if_read_dly_en    : 1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t sf_if_int            : 1; /* [   16],          r,        0x0 */
            uint32_t sf_if_int_clr        : 1; /* [   17],        r/w,        0x1 */
            uint32_t sf_if_int_set        : 1; /* [   18],        r/w,        0x0 */
            uint32_t sf_if_32b_adr_en     : 1; /* [   19],        r/w,        0x0 */
            uint32_t sf_aes_dout_endian   : 1; /* [   20],        r/w,        0x1 */
            uint32_t sf_aes_din_endian    : 1; /* [   21],        r/w,        0x1 */
            uint32_t sf_aes_key_endian    : 1; /* [   22],        r/w,        0x1 */
            uint32_t sf_aes_iv_endian     : 1; /* [   23],        r/w,        0x1 */
            uint32_t sf_id                : 8; /* [31:24],        r/w,       0x1a */
        } BF;
        uint32_t WORD;
    } sf_ctrl_0;

