XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
    /* 0x4 : sf_ctrl_1 */
    union {
        struct {
            uint32_t sf_if_sr_pat_mask  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t sf_if_sr_pat       : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t sf_if_sr_int       : 1; /* [   16],          r,        0x0 */
            uint32_t sf_if_sr_int_en    : 1; /* [   17],        r/w,        0x0 */
            uint32_t sf_if_sr_int_set   : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19        : 1; /* [   19],       rsvd,        0x0 */
            uint32_t sf_if_0_ack_lat    : 3; /* [22:20],        r/w,        0x6 */
            uint32_t sf_ahb2sif_diswrap : 1; /* [   23],        r/w,        0x0 */
            uint32_t sf_if_reg_hold     : 1; /* [   24],        r/w,        0x1 */
            uint32_t sf_if_reg_wp       : 1; /* [   25],        r/w,        0x1 */
            uint32_t sf_ahb2sif_stopped : 1; /* [   26],          r,        0x0 */
            uint32_t sf_ahb2sif_stop    : 1; /* [   27],        r/w,        0x0 */
            uint32_t sf_if_fn_sel       : 1; /* [   28],        r/w,        0x1 */
            uint32_t sf_if_en           : 1; /* [   29],        r/w,        0x1 */
            uint32_t sf_ahb2sif_en      : 1; /* [   30],        r/w,        0x1 */
            uint32_t sf_ahb2sram_en     : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_1;

    /* 0x8 : sf_if_sahb_0 */
    union {
        struct {
            uint32_t sf_if_busy          : 1;  /* [    0],          r,        0x0 */
            uint32_t sf_if_0_trig        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t sf_if_0_dat_byte    : 10; /* [11: 2],        r/w,       0xff */
            uint32_t sf_if_0_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t sf_if_0_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if_0_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if_0_dat_rw      : 1;  /* [   23],        r/w,        0x0 */
            uint32_t sf_if_0_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if_0_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_if_0_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if_0_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_0_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_0_qpi_mode_en : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_sahb_0;

    /* 0xC : sf_if_sahb_1 */
    union {
        struct {
            uint32_t sf_if_0_cmd_buf_0 : 32; /* [31: 0],        r/w,  0x3000000 */
        } BF;
        uint32_t WORD;
    } sf_if_sahb_1;

    /* 0x10 : sf_if_sahb_2 */
    union {
        struct {
            uint32_t sf_if_0_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_sahb_2;

    /* 0x14 : sf_if_iahb_0 */
    union {
        struct {
            uint32_t reserved_0_11       : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t sf_if_1_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t sf_if_1_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if_1_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if_1_dat_rw      : 1;  /* [   23],        r/w,        0x0 */
            uint32_t sf_if_1_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if_1_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_if_1_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if_1_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_1_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_1_qpi_mode_en : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_0;

    /* 0x18 : sf_if_iahb_1 */
    union {
        struct {
            uint32_t sf_if_1_cmd_buf_0 : 32; /* [31: 0],        r/w,  0x3000000 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_1;

    /* 0x1C : sf_if_iahb_2 */
    union {
        struct {
            uint32_t sf_if_1_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_2;

    /* 0x20 : sf_if_status_0 */
    union {
        struct {
            uint32_t sf_if_status_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_status_0;

    /* 0x24 : sf_if_status_1 */
    union {
        struct {
            uint32_t sf_if_status_1 : 32; /* [31: 0],          r, 0x20000000 */
        } BF;
        uint32_t WORD;
    } sf_if_status_1;

    /* 0x28 : sf_aes */
    union {
        struct {
            uint32_t sf_aes_en          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t sf_aes_mode        : 2;  /* [ 2: 1],        r/w,        0x0 */
            uint32_t sf_aes_blk_mode    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t sf_aes_xts_key_opt : 1;  /* [    4],        r/w,        0x0 */
            uint32_t sf_aes_status      : 27; /* [31: 5],          r,        0x2 */
        } BF;
        uint32_t WORD;
    } sf_aes;

    /* 0x2C : sf_ahb2sif_status */
    union {
        struct {
            uint32_t sf_ahb2sif_status : 32; /* [31: 0],          r,  0x1010003 */
        } BF;
        uint32_t WORD;
    } sf_ahb2sif_status;

    /* 0x30 : sf_if_io_dly_0 */
    union {
        struct {
            uint32_t sf_cs_dly_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t sf_cs2_dly_sel     : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reserved_4_7       : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t sf_clk_out_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_25     : 16; /* [25:10],       rsvd,        0x0 */
            uint32_t sf_dqs_oe_dly_sel  : 2;  /* [27:26],        r/w,        0x0 */
            uint32_t sf_dqs_di_dly_sel  : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t sf_dqs_do_dly_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_io_dly_0;

    /* 0x34 : sf_if_io_dly_1 */
    union {
        struct {
            uint32_t sf_io_0_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf_io_0_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf_io_0_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31     : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_io_dly_1;

