XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
    /* 0xC8 : sf_if2_sahb_0 */
    union {
        struct {
            uint32_t sf_if2_busy          : 1;  /* [    0],          r,        0x0 */
            uint32_t sf_if2_0_trig        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t sf_if2_0_dat_byte    : 10; /* [11: 2],        r/w,       0xff */
            uint32_t sf_if2_0_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t sf_if2_0_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if2_0_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if2_0_dat_rw      : 1;  /* [   23],        r/w,        0x0 */
            uint32_t sf_if2_0_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if2_0_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_if2_0_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if2_0_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if2_0_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if2_0_qpi_mode_en : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if2_sahb_0;

    /* 0xCC : sf_if2_sahb_1 */
    union {
        struct {
            uint32_t sf_if2_0_cmd_buf_0 : 32; /* [31: 0],        r/w,  0x3000000 */
        } BF;
        uint32_t WORD;
    } sf_if2_sahb_1;

    /* 0xD0 : sf_if2_sahb_2 */
    union {
        struct {
            uint32_t sf_if2_0_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if2_sahb_2;

    /* 0xd4  reserved */
    uint8_t RESERVED0xd4[44];

    /* 0x100 : sf_ctrl_prot_en_rd */
    union {
        struct {
            uint32_t reserved_0            : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t sf_ctrl_id0_en_rd     : 1;  /* [    1],          r,        0x1 */
            uint32_t sf_ctrl_id1_en_rd     : 1;  /* [    2],          r,        0x1 */
            uint32_t reserved_3_27         : 25; /* [27: 3],       rsvd,        0x0 */
            uint32_t sf_sec_tzsid_lock     : 1;  /* [   28],          r,        0x0 */
            uint32_t sf_if2_0_trig_wr_lock : 1;  /* [   29],          r,        0x0 */
            uint32_t sf_if_0_trig_wr_lock  : 1;  /* [   30],          r,        0x0 */
            uint32_t sf_dbg_dis            : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_prot_en_rd;

    /* 0x104 : sf_ctrl_prot_en */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t sf_ctrl_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t sf_ctrl_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31  : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_prot_en;

    /* 0x108  reserved */
    uint8_t RESERVED0x108[248];

    /* 0x200 : sf_aes_key_r0_0 */
    union {
        struct {
            uint32_t sf_aes_key_r0_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_0;

    /* 0x204 : sf_aes_key_r0_1 */
    union {
        struct {
            uint32_t sf_aes_key_r0_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_1;

    /* 0x208 : sf_aes_key_r0_2 */
    union {
        struct {
            uint32_t sf_aes_key_r0_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_2;

    /* 0x20C : sf_aes_key_r0_3 */
    union {
        struct {
            uint32_t sf_aes_key_r0_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_3;

    /* 0x210 : sf_aes_key_r0_4 */
    union {
        struct {
            uint32_t sf_aes_key_r0_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_4;

    /* 0x214 : sf_aes_key_r0_5 */
    union {
        struct {
            uint32_t sf_aes_key_r0_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_5;

    /* 0x218 : sf_aes_key_r0_6 */
    union {
        struct {
            uint32_t sf_aes_key_r0_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_6;

    /* 0x21C : sf_aes_key_r0_7 */
    union {
        struct {
            uint32_t sf_aes_key_r0_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_7;

    /* 0x220 : sf_aes_iv_r0_w0 */
    union {
        struct {
            uint32_t sf_aes_iv_r0_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w0;

    /* 0x224 : sf_aes_iv_r0_w1 */
    union {
        struct {
            uint32_t sf_aes_iv_r0_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w1;

    /* 0x228 : sf_aes_iv_r0_w2 */
    union {
        struct {
            uint32_t sf_aes_iv_r0_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w2;

    /* 0x22C : sf_aes_iv_r0_w3 */
    union {
        struct {
            uint32_t sf_aes_iv_r0_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w3;

    /* 0x230 : sf_aes_r0_start */
    union {
        struct {
            uint32_t sf_aes_region_r0_start     : 19; /* [18: 0],        r/w,        0x0 */
            uint32_t reserved_19_28             : 10; /* [28:19],       rsvd,        0x0 */
            uint32_t sf_aes_region_r0_hw_key_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_region_r0_en        : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_region_r0_lock      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_r0_start;

