XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sf_ctrl_reg.h
    /* 0x32C : sf_aes_iv_r2_w3 */
    union {
        struct {
            uint32_t sf_aes_iv_r2_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w3;

    /* 0x330 : sf_aes_r2_start */
    union {
        struct {
            uint32_t sf_aes_r2_start     : 19; /* [18: 0],        r/w,        0x0 */
            uint32_t reserved_19_28      : 10; /* [28:19],       rsvd,        0x0 */
            uint32_t sf_aes_r2_hw_key_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_r2_en        : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_r2_lock      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_r2_start;

    /* 0x334 : sf_aes_r2_end */
    union {
        struct {
            uint32_t sf_aes_r2_end  : 19; /* [18: 0],        r/w,     0x3fff */
            uint32_t reserved_19_31 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_r2_end;
};

typedef volatile struct sf_ctrl_reg sf_ctrl_reg_t;

/*Following is reg patch*/

/* 0x0 : sf_if_sahb_0 */
#define SF_CTRL_IF_SAHB_0_OFFSET      (0x0)
#define SF_CTRL_IF_BUSY               SF_CTRL_IF_BUSY
#define SF_CTRL_IF_BUSY_POS           (0U)
#define SF_CTRL_IF_BUSY_LEN           (1U)
#define SF_CTRL_IF_BUSY_MSK           (((1U << SF_CTRL_IF_BUSY_LEN) - 1) << SF_CTRL_IF_BUSY_POS)
#define SF_CTRL_IF_BUSY_UMSK          (~(((1U << SF_CTRL_IF_BUSY_LEN) - 1) << SF_CTRL_IF_BUSY_POS))
#define SF_CTRL_IF_0_TRIG             SF_CTRL_IF_0_TRIG
#define SF_CTRL_IF_0_TRIG_POS         (1U)
#define SF_CTRL_IF_0_TRIG_LEN         (1U)
#define SF_CTRL_IF_0_TRIG_MSK         (((1U << SF_CTRL_IF_0_TRIG_LEN) - 1) << SF_CTRL_IF_0_TRIG_POS)
#define SF_CTRL_IF_0_TRIG_UMSK        (~(((1U << SF_CTRL_IF_0_TRIG_LEN) - 1) << SF_CTRL_IF_0_TRIG_POS))
#define SF_CTRL_IF_0_DAT_BYTE         SF_CTRL_IF_0_DAT_BYTE
#define SF_CTRL_IF_0_DAT_BYTE_POS     (2U)
#define SF_CTRL_IF_0_DAT_BYTE_LEN     (10U)
#define SF_CTRL_IF_0_DAT_BYTE_MSK     (((1U << SF_CTRL_IF_0_DAT_BYTE_LEN) - 1) << SF_CTRL_IF_0_DAT_BYTE_POS)
#define SF_CTRL_IF_0_DAT_BYTE_UMSK    (~(((1U << SF_CTRL_IF_0_DAT_BYTE_LEN) - 1) << SF_CTRL_IF_0_DAT_BYTE_POS))
#define SF_CTRL_IF_0_DMY_BYTE         SF_CTRL_IF_0_DMY_BYTE
#define SF_CTRL_IF_0_DMY_BYTE_POS     (12U)
#define SF_CTRL_IF_0_DMY_BYTE_LEN     (5U)
#define SF_CTRL_IF_0_DMY_BYTE_MSK     (((1U << SF_CTRL_IF_0_DMY_BYTE_LEN) - 1) << SF_CTRL_IF_0_DMY_BYTE_POS)
#define SF_CTRL_IF_0_DMY_BYTE_UMSK    (~(((1U << SF_CTRL_IF_0_DMY_BYTE_LEN) - 1) << SF_CTRL_IF_0_DMY_BYTE_POS))
#define SF_CTRL_IF_0_ADR_BYTE         SF_CTRL_IF_0_ADR_BYTE
#define SF_CTRL_IF_0_ADR_BYTE_POS     (17U)
#define SF_CTRL_IF_0_ADR_BYTE_LEN     (3U)
#define SF_CTRL_IF_0_ADR_BYTE_MSK     (((1U << SF_CTRL_IF_0_ADR_BYTE_LEN) - 1) << SF_CTRL_IF_0_ADR_BYTE_POS)
#define SF_CTRL_IF_0_ADR_BYTE_UMSK    (~(((1U << SF_CTRL_IF_0_ADR_BYTE_LEN) - 1) << SF_CTRL_IF_0_ADR_BYTE_POS))
#define SF_CTRL_IF_0_CMD_BYTE         SF_CTRL_IF_0_CMD_BYTE
#define SF_CTRL_IF_0_CMD_BYTE_POS     (20U)
#define SF_CTRL_IF_0_CMD_BYTE_LEN     (3U)
#define SF_CTRL_IF_0_CMD_BYTE_MSK     (((1U << SF_CTRL_IF_0_CMD_BYTE_LEN) - 1) << SF_CTRL_IF_0_CMD_BYTE_POS)
#define SF_CTRL_IF_0_CMD_BYTE_UMSK    (~(((1U << SF_CTRL_IF_0_CMD_BYTE_LEN) - 1) << SF_CTRL_IF_0_CMD_BYTE_POS))
#define SF_CTRL_IF_0_DAT_RW           SF_CTRL_IF_0_DAT_RW
#define SF_CTRL_IF_0_DAT_RW_POS       (23U)
#define SF_CTRL_IF_0_DAT_RW_LEN       (1U)
#define SF_CTRL_IF_0_DAT_RW_MSK       (((1U << SF_CTRL_IF_0_DAT_RW_LEN) - 1) << SF_CTRL_IF_0_DAT_RW_POS)
#define SF_CTRL_IF_0_DAT_RW_UMSK      (~(((1U << SF_CTRL_IF_0_DAT_RW_LEN) - 1) << SF_CTRL_IF_0_DAT_RW_POS))
#define SF_CTRL_IF_0_DAT_EN           SF_CTRL_IF_0_DAT_EN
#define SF_CTRL_IF_0_DAT_EN_POS       (24U)
#define SF_CTRL_IF_0_DAT_EN_LEN       (1U)
#define SF_CTRL_IF_0_DAT_EN_MSK       (((1U << SF_CTRL_IF_0_DAT_EN_LEN) - 1) << SF_CTRL_IF_0_DAT_EN_POS)
#define SF_CTRL_IF_0_DAT_EN_UMSK      (~(((1U << SF_CTRL_IF_0_DAT_EN_LEN) - 1) << SF_CTRL_IF_0_DAT_EN_POS))
#define SF_CTRL_IF_0_DMY_EN           SF_CTRL_IF_0_DMY_EN
#define SF_CTRL_IF_0_DMY_EN_POS       (25U)
#define SF_CTRL_IF_0_DMY_EN_LEN       (1U)
#define SF_CTRL_IF_0_DMY_EN_MSK       (((1U << SF_CTRL_IF_0_DMY_EN_LEN) - 1) << SF_CTRL_IF_0_DMY_EN_POS)
#define SF_CTRL_IF_0_DMY_EN_UMSK      (~(((1U << SF_CTRL_IF_0_DMY_EN_LEN) - 1) << SF_CTRL_IF_0_DMY_EN_POS))
#define SF_CTRL_IF_0_ADR_EN           SF_CTRL_IF_0_ADR_EN
#define SF_CTRL_IF_0_ADR_EN_POS       (26U)
#define SF_CTRL_IF_0_ADR_EN_LEN       (1U)
#define SF_CTRL_IF_0_ADR_EN_MSK       (((1U << SF_CTRL_IF_0_ADR_EN_LEN) - 1) << SF_CTRL_IF_0_ADR_EN_POS)
#define SF_CTRL_IF_0_ADR_EN_UMSK      (~(((1U << SF_CTRL_IF_0_ADR_EN_LEN) - 1) << SF_CTRL_IF_0_ADR_EN_POS))
#define SF_CTRL_IF_0_CMD_EN           SF_CTRL_IF_0_CMD_EN
#define SF_CTRL_IF_0_CMD_EN_POS       (27U)
#define SF_CTRL_IF_0_CMD_EN_LEN       (1U)
#define SF_CTRL_IF_0_CMD_EN_MSK       (((1U << SF_CTRL_IF_0_CMD_EN_LEN) - 1) << SF_CTRL_IF_0_CMD_EN_POS)
#define SF_CTRL_IF_0_CMD_EN_UMSK      (~(((1U << SF_CTRL_IF_0_CMD_EN_LEN) - 1) << SF_CTRL_IF_0_CMD_EN_POS))
#define SF_CTRL_IF_0_SPI_MODE         SF_CTRL_IF_0_SPI_MODE
#define SF_CTRL_IF_0_SPI_MODE_POS     (28U)
#define SF_CTRL_IF_0_SPI_MODE_LEN     (3U)
#define SF_CTRL_IF_0_SPI_MODE_MSK     (((1U << SF_CTRL_IF_0_SPI_MODE_LEN) - 1) << SF_CTRL_IF_0_SPI_MODE_POS)
#define SF_CTRL_IF_0_SPI_MODE_UMSK    (~(((1U << SF_CTRL_IF_0_SPI_MODE_LEN) - 1) << SF_CTRL_IF_0_SPI_MODE_POS))
#define SF_CTRL_IF_0_QPI_MODE_EN      SF_CTRL_IF_0_QPI_MODE_EN
#define SF_CTRL_IF_0_QPI_MODE_EN_POS  (31U)
#define SF_CTRL_IF_0_QPI_MODE_EN_LEN  (1U)
#define SF_CTRL_IF_0_QPI_MODE_EN_MSK  (((1U << SF_CTRL_IF_0_QPI_MODE_EN_LEN) - 1) << SF_CTRL_IF_0_QPI_MODE_EN_POS)
#define SF_CTRL_IF_0_QPI_MODE_EN_UMSK (~(((1U << SF_CTRL_IF_0_QPI_MODE_EN_LEN) - 1) << SF_CTRL_IF_0_QPI_MODE_EN_POS))

/* 0x4 : sf_if_sahb_1 */
#define SF_CTRL_IF_SAHB_1_OFFSET    (0x4)
#define SF_CTRL_IF_0_CMD_BUF_0      SF_CTRL_IF_0_CMD_BUF_0
#define SF_CTRL_IF_0_CMD_BUF_0_POS  (0U)
#define SF_CTRL_IF_0_CMD_BUF_0_LEN  (32U)
#define SF_CTRL_IF_0_CMD_BUF_0_MSK  (((1U << SF_CTRL_IF_0_CMD_BUF_0_LEN) - 1) << SF_CTRL_IF_0_CMD_BUF_0_POS)
#define SF_CTRL_IF_0_CMD_BUF_0_UMSK (~(((1U << SF_CTRL_IF_0_CMD_BUF_0_LEN) - 1) << SF_CTRL_IF_0_CMD_BUF_0_POS))

/* 0x8 : sf_if_sahb_2 */
#define SF_CTRL_IF_SAHB_2_OFFSET    (0x8)
#define SF_CTRL_IF_0_CMD_BUF_1      SF_CTRL_IF_0_CMD_BUF_1
#define SF_CTRL_IF_0_CMD_BUF_1_POS  (0U)
#define SF_CTRL_IF_0_CMD_BUF_1_LEN  (32U)
#define SF_CTRL_IF_0_CMD_BUF_1_MSK  (((1U << SF_CTRL_IF_0_CMD_BUF_1_LEN) - 1) << SF_CTRL_IF_0_CMD_BUF_1_POS)
#define SF_CTRL_IF_0_CMD_BUF_1_UMSK (~(((1U << SF_CTRL_IF_0_CMD_BUF_1_LEN) - 1) << SF_CTRL_IF_0_CMD_BUF_1_POS))

struct sf_if_sahb_0_reg {
    /* 0x0 : sf_if_sahb_0 */
    union {
        struct {
            uint32_t if_busy          : 1;  /* [    0],          r,        0x0 */
            uint32_t if_0_trig        : 1;  /* [    1],        r/w,        0x0 */
            uint32_t if_0_dat_byte    : 10; /* [11: 2],        r/w,       0xff */
            uint32_t if_0_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t if_0_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t if_0_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t if_0_dat_rw      : 1;  /* [   23],        r/w,        0x0 */
            uint32_t if_0_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t if_0_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t if_0_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t if_0_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t if_0_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t if_0_qpi_mode_en : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } if_sahb_0;

    /* 0x4 : sf_if_sahb_1 */
    union {
        struct {
            uint32_t if_0_cmd_buf_0 : 32; /* [31: 0],        r/w,  0x3000000 */
        } BF;
        uint32_t WORD;
    } if_sahb_1;

    /* 0x8 : sf_if_sahb_2 */
    union {
        struct {
            uint32_t if_0_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } if_sahb_2;
};

